app/views/discussions/show.html.haml

                - @discussion.comments.where('comment_votes_count>0').order('comment_votes_count desc').limit(3).each do |comment|
                  %li.selector-item.empty-list-message#top-votes= render 'comments/comment_limited', comment: comment
          .col-sm-12#content-procons
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."discussion_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["discussion_id", 1], ["id", 0]]