app/controllers/discussions_controller.rb

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = 1 LIMIT 1
---
  def new

    logger.info ">>>>>>>>>>>>>>>> new"

    @discussion = Discussion.new
    @discussion.uses_markdown = current_user.uses_markdown
    @group = Group.find_by_id params[:group_id]

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "motions".* FROM "motions"  WHERE "motions"."discussion_id" = $1 AND (motions.closed_at IS NULL)  ORDER BY motions.closed_at ASC LIMIT 1  [["discussion_id", 1]]
SELECT COUNT(*) FROM "motions"  WHERE "motions"."discussion_id" = $1 AND (closed_at IS NOT NULL)  [["discussion_id", 1]]
---
  def show

    logger.info ">>>>>>>>>>>>>>>> show"

    @group = @discussion.group

    if params[:proposal]
      @motion = @discussion.motions.find_by_key!(params[:proposal])
    else
      @motion = @discussion.most_recent_motion
    end

    if @motion
      @motion_reader = MotionReader.for(user: current_user_or_visitor, motion: @motion)
    end

    if can?(:move, @discussion)
      @destination_groups = current_user_or_visitor.groups.order(:name).uniq.reject { |g| g.id == @group.id }
    end

    @discussion_reader = DiscussionReader.for(user: current_user_or_visitor, discussion: @discussion)

    @closed_motions = @discussion.closed_motions

    @uses_markdown = current_user_or_visitor.uses_markdown?

    @activity = @discussion.activity.page(requested_or_first_unread_page).per(Discussion::PER_PAGE)

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "motions".* FROM "motions"  WHERE "motions"."discussion_id" = $1 AND (motions.closed_at IS NULL)  ORDER BY motions.closed_at ASC LIMIT 1  [["discussion_id", 1]]
---
  def new_proposal

    logger.info ">>>>>>>>>>>>>>>> new_proposal"


    if @discussion.current_motion
      redirect_to @discussion
      flash[:notice] = "A current proposal already exists for this discussion."
    else
      @motion = Motion.new
      @motion.discussion = @discussion
      @group = @discussion.group

SELECT  "discussions".* FROM "discussions"  WHERE "discussions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
---
  def find_group

    logger.info ">>>>>>>>>>>>>>>> find_group"


    if (params[:id] && (params[:id] != "new"))
      Discussion.published.find(params[:id]).group