app/controllers/pro_cons_controller.rb

  def create

    logger.info ">>>>>>>>>>>>>>>> create"
    logger.info ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> 2 #{session[:return_to].inspect}"
    discussion = current_user.discussions.find(session[:return_to][:discussion])

    @pro_cons = ProCon.new(pro_con_params)
    @pro_cons.discussion_id = discussion.id

    @pro_cons.save!
---
INSERT INTO "pro_cons" ("body", "cons", "created_at", "discussion_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "demo"], ["cons", "f"], ["created_at", "2014-10-23 13:04:41.691041"], ["discussion_id", 1], ["updated_at", "2014-10-23 13:04:41.691041"]]

  def index
    @pro_cons = ProCon.all
---
SELECT "pro_cons".* FROM "pro_cons"